---
layout: single
title:  "[파이썬(Python)] 실행 흐름 (flow of execution)"
categories: Python
tag: [Python, 파이썬, flow of execution]
toc: true
toc_sticky: true
toc_label: '페이지 주요 목자'
author_profile: false
sidebar:
    nav: "docs"
---




## 실행 흐름 (flow of execution)

처음으로 함수가 사용되기 전에 정의되었는지를 확인하기 위해서, 명령문 실행 순서를 파악해야 하는데 이를 실행 흐름 (flow of execution) 이라고 한다.

프로그램 실행은 항상 프로그램 첫 문장부터 시작한다. 명령문은 한번에 하나씩 위에서 아래로 실행된다.

함수 정의 (definition) 가 프로그램 실행 수선를 바꾸지는 않는다. 하지만, 함수 내부의 문장은 함수가 호출될 때까지 실행되지 않는다는 것을 기억하자.

함수 호출은 프로그램 실행 흐름을 우회하는 것과 같다. 다음 문장으로 가기전에, 실행 흐름은 함수 몸통 부문을 실행하고는 건너뛰기를 시작한 지점으로 다시 돌아온다.

함수가 또 다른 함수를 호출한다는 것은 기억할 때까지는 매우 간단하게 들린다. 함수 중간에 프로그램이 또 다름 함수의 문장을 수행할지도 모른다. 하지만, 새로운 함수를 실행하는 중간에 프로그램이 또 다른 함수를 실행할지도 모른다.

다행스럽게도, 파이썬은 프로그램 실행 위치를 정확히 추적한다. 그래서 함수가 실행을 완료할 때마다 프로그램을 함수를 호출해서 떠난 지점으로 정확히 되돌려 놓는다. 프로그램이 마지막에 도달했을 때, 프로그램은 종료한다.

프로그램을 읽을 때, 위에서부터 아래로 읽을 필요는 없다. 때때로, 실행 흐름을 따르는 것이 좀 더 이치에 맞다.
